let userArr = parseInt(prompt(`Кількість елементів`, "10")!);
//========================================================================================================================================================
/*
	Користувач вводить кількість елементів.Створити масив, 
	що складається з вказаної кількості елементів заповнених нулями.
*/
let newArr = new Array(userArr).fill(0);
document.write(`Масив : ${newArr}<br>`);
//========================================================================================================================================================
/*
	Користувач вводить кількість елементів.
	Створити масив, у якому перша половина заповнена 1-цями, 
	а друга заповнена 7-ками.
*/
//========================================================================================================================================================
let newArr1 = new Array(userArr).fill(7);
newArr1.fill(1, 0, newArr1.length / 2);
document.write(`Масив : ${newArr1}<br>`);
/*
	Користувач вводить кількість елементів. 
	Створити масив, у якому перші 5 елементів заповнені 1-цями,
	а інші до кінця масиву заповнені 7-ками.
*/
//========================================================================================================================================================
let newArr2 = new Array(userArr).fill(7);
newArr2.fill(1, 0, 5);
document.write(`Масив : ${newArr2}<br>`);
//========================================================================================================================================================
/*
	Дано масив елементів. Вивести на екран елементи, що більші за 100
*/
let arrElement = [12, 344, 67, 888, 3, 456];
for (const element of arrElement) {
  if (element > 100) {
    document.write(`Eлементи : ${element}<br>`);
  }
}
//========================================================================================================================================================
/*
		Дано масив елементів. Знайти добуток додатних елементів
*/

let elementArr = [
  -8.5, -9.2, 10.1, 11.3, 15.0, 18.6, 20.7, 20.2, 16.5, 11.9, -6.9, -3.9,
];
let product = 1;
for (const element of elementArr) {
  if (element > 0) {
    product *= element;
  }
}
document.write(`додатних : ${product.toFixed(2)}<br>`);
//========================================================================================================================================================
/*
	Дано масив елементів. Усі елементи, які більші за перший елемент помножити на 2
*/
let elementArr1 = [4, -8.5, -9.2, 1, 10, 20, -6.9, -3.9];
let productElement = elementArr1[0];
elementArr1.forEach((element, i, arr) => {
  if (productElement < arr[i]) {
    arr[i] = element * 2;
  }
});
document.write(`Оновлений масив: ${elementArr1}<br>`);
//========================================================================================================================================================
/*
	Дано масив цін. Змінити цей масив так, що на ціни товарів, які більші за 1000 грн. дати 30% знижки.
*/
let pricesArr = [800, 500, 1000, 1500, 2600, 150];
pricesArr.forEach((element, i, arr) => {
  if (element > 1000) {
    arr[i] = element * 0.7;
  }
});
document.write(
  `Оновлений масив: ${pricesArr.map((p) => p.toFixed(2))} грн <br>`,
);
//========================================================================================================================================================
/*
	Дано масив номерів авто. Сформувати новий масив тих, які починаються на «А»
*/
let carArr = [`BR5623`, `DF5663`, `AA5455`, `AB3654`, `AS45648`];

let newCarArr = carArr.filter((carArr) => {
  return carArr[0] === `A`;
});
document.write(` ${newCarArr}<br>`);
//========================================================================================================================================================
/*
	Дано масив імен. Сформувати масив з перших літер цих імен.
*/
let nameArr = [`Lex`, `Roma`, `Jon`, `Slava`];
let newNameArr = nameArr.map((name) => {
  return name[0];
});
document.write(` ${newNameArr}<br>`);
/*
	Дано масив цін у грн. Податок складає 20%. Сформувати масив, який буде містити величину сплаченого податку у грн.
*/

let arrPricesArr = [800, 500, 1000, 1500, 2600, 150];
let newArrPricesArr = arrPricesArr.map((name) => {
  return name *0.2;
});
document.write(
  `Оновлений масив: ${newArrPricesArr} грн <br>`,
);