"use strict";
// Дано історію цін на цінні папери за деякий період (згенерувати від 1 до 10000)
const period = parseInt(prompt(`Ведіть довжину масива`, '40'));
function getPriceRandom(min, max) {
    return Math.floor(Math.random() * (max - min + 1)) + min;
}
let prices = Array.from({ length: period }, () => getPriceRandom(1, 10000));
document.write(`price20 : ${prices}<br>`);
//========================================================================================================================================================
//1)Сформувати новий масив, у якому є тільки ті, що більші за 1000 грн.
let price1000 = prices.filter((price) => price > 1000);
document.write(`price100 : ${price1000}<br>`);
//========================================================================================================================================================
//2)Сформувати новий масив, у якому є номери тільки тих, що більші за 1000 грн.
let priceIndexs = prices.reduce((a, x, index) => {
    if (x > 1000)
        a.push(index);
    return a;
}, []);
document.write(`priceIndexs : ${priceIndexs}<br>`);
//========================================================================================================================================================
// 3)Сформувати список з тих цін, які більші за попереднє значення
let priceNev = prices.filter((price, i, arr) => {
    return i > 0 && price > arr[i - 1];
});
document.write(`priceNev : ${priceNev}<br>`);
//========================================================================================================================================================
// 4)Сформувати новий масив, що міститиме значення цін у відсотках стосовно максимального
let pricePercentage = prices.map((element) => (element * 100) / 10000);
document.write(`pricePercentage : ${pricePercentage} <br>`);
//========================================================================================================================================================
// 5)Підрахувати кількість змін цін
let priceSum = prices.reduce((prevMap, element, i, arr) => {
    if (i > 0 && element !== arr[i - 1]) {
        return prevMap + 1;
    }
    return prevMap;
}, 0);
document.write(`priceSum : ${priceSum} <br>`);
//========================================================================================================================================================
// 6)Визначити, чи є ціна, що менше 1000
let priceSome = prices.some((price) => price < 1000) ? "Yes" : "NO";
document.write(`priceSome : ${priceSome} <br>`);
//========================================================================================================================================================
// 7)Визначати, чи усі ціни більше за 1000
let priceEvery = prices.every((price) => price > 1000) ? "NO" : "Yes";
document.write(`priceEvery : ${priceEvery} <br>`);
//========================================================================================================================================================
// 8)Підрахувати кількість цін, що більше за 1000
let priceWhat = prices.filter((price) => price > 1000).length;
document.write(`priceWhat : ${priceWhat} <br>`);
//==================================================
// 9)Підрахувати суму цін, що більше за 1000
let priceWhatSum = prices.reduce((prevMap, element) => {
    if (element > 1000) {
        prevMap += element;
    }
    return prevMap;
}, 0);
document.write(`priceWhatSum : ${priceWhatSum} <br>`);
//========================================================================================================================================================
// 10)Знайти першу ціну, що більше за 1000
let priceFirst = prices.find((price) => price > 1000);
document.write(`priceFirst : ${priceFirst} <br>`);
//========================================================================================================================================================
// 11)Знайти індекс першої ціни, що більше за 1000
let priceFirstIndex = prices.findIndex((price) => price > 1000);
document.write(`priceFirstIndex : ${priceFirstIndex} <br>`);
//========================================================================================================================================================
//12)Знайти останню ціну, що більше за 1000
let priceLast = prices.findLast((price) => price > 1000);
document.write(`priceLast : ${priceLast} <br>`);
//========================================================================================================================================================
// 13)Знайти індекс останньої ціни, що більше за 1000
let priceLastIndex = prices.findLastIndex((price) => price > 1000);
document.write(`priceLastIndex : ${priceLastIndex} <br>`);
