/*
	---		Задача 1. 
	Описати масив об’єктів – сайтів розроблених компанією з такими властивостями
		----- Властивості ------
		назва компанії на час розробки (назву періодично змінюють)
		власник компанії
		споснсори (масив спонсорів)
					* прізвище спонсора
					* ім’я  спонсора
					* сума вкладень спонсора
		рік випуску
		вартість сайту
*/
type SponsorType = {
  sponsorlast: string;
  sponsorName: string;
  sponsorInvestment: number;
};
type PropertiType = {
	title: string,
	holder: string,
	sponsors: SponsorType[],
	year: number,
	praisSite: number,	
}
let listPropertiCompani: PropertiType[] = [
  {
    title: "Facebook",
    holder: "Марк Цукерберг",
    sponsors: ([] = [
      {
        sponsorlast: "Тіль",
        sponsorName: "Пітер",
        sponsorInvestment: 500000,
      },
      {
        sponsorlast: "Аксель",
        sponsorName: "Джим",
        sponsorInvestment: 12700000,
      },
    ]),
    year: 2004,
    praisSite: 1000000000,
  },
  {
    title: "Google",
    holder: "Ларрі Пейдж",
    sponsors: ([] = [
      {
        sponsorlast: "Безос",
        sponsorName: "Джефф",
        sponsorInvestment: 250000,
      },
      {
        sponsorlast: "Дорр",
        sponsorName: "Джон",
        sponsorInvestment: 100000000,
      },
    ]),
    year: 1998,
    praisSite: 1800000000,    
  },
  {
    title: "Twitter",
    holder: "Ілон Маск",
    sponsors: ([] = [
      {
        sponsorlast: "Вільямс",
        sponsorName: "Еван",
        sponsorInvestment: 5000000,
      },
      {
        sponsorlast: "Дорсі",
        sponsorName: "Джек",
        sponsorInvestment: 3000000,
      },
    ]),
    year: 2006,
    praisSite: 44000000,
  },
];
//========================================================================================================================================================
//  --Знайти:
//========================================================================================================================================================
//	--	1) загальну вартість усіх сайтів
//========================================================================================================================================================
let totalPrais = listPropertiCompani.reduce(
  (parse, properti) => parse + properti.praisSite, 0);
	document.write(
  `Загальна вартість усіх сайтів: ${totalPrais}<br>`,
);
//========================================================================================================================================================
//	--	2) кількість сайтів, що було зроблено між 2000 та 2009 рр
//========================================================================================================================================================
let siteNamber = listPropertiCompani.reduce(
	(element, year) =>
		year.year >= 2000 && year.year <= 2009
		? element + 1
		: element,
	0
);
document.write(
  `Кількість сайтів, що було зроблено між 2000 та 2009 рр = ${siteNamber}<br>`,
);
//========================================================================================================================================================
//	--	3) кількість сайтів, де сума спонсорських вкладень була більшою за 100000
//========================================================================================================================================================
let sumSponsors10000 = listPropertiCompani.filter((element) => {
	let sunElement = element.sponsors.reduce(
		(element, sponsor) => element + sponsor.sponsorInvestment,
		0,
	);
	return sunElement > 100000;
}).length;
document.write(
  `Кількість сайтів, де сума спонсорських вкладень була більшою за 100000 = ${sumSponsors10000}<br>`,
);
//========================================================================================================================================================
//	--	4) створити загальний список усіх спонсорів (поки можуть повторюватись, просто зібрати усі у масив)
//========================================================================================================================================================
let generalListSponsor = listPropertiCompani.map((el) => el.sponsors).flat();
console.log(generalListSponsor);
//========================================================================================================================================================
//	--	5) знайти рік, коли прибуток був найбільшим
//========================================================================================================================================================
let profitMaxYear = listPropertiCompani.reduce(
	(maxProfit, currentProfit) => 
		maxProfit.praisSite > currentProfit.praisSite
      ? maxProfit 
      : currentProfit,	
);
console.log(profitMaxYear.year);
document.write(`Рік, коли прибуток був найбільшим = ${profitMaxYear.year}<br>`);
//========================================================================================================================================================
//	--	6) упорядкувати список за спаданням прибутку
//========================================================================================================================================================
let sortList = [...listPropertiCompani].sort((a, b) => b.praisSite - a.praisSite);
console.log(sortList);
//========================================================================================================================================================
//	--	7) Створити 2 окремих списки з копіями об’єктів, що містять сайти з вартість до 10000 і більше 10000
//========================================================================================================================================================
let listPrais10000 = listPropertiCompani.filter((el) => el.praisSite <= 10000);
let listPraisMore10000 = listPropertiCompani.filter((el) => el.praisSite > 10000);
console.log(listPrais10000);
console.log(listPraisMore10000);

