/*
  Дано прибуток магазину за К тижнів. Знайти загальний прибуток
*/
let incomes = [
  // 0  1  2  3  4  5  6
  [1, 2, 5, 2, 1, 2, 9], // 0
  [1, 2, 1, 2, 1, 2, 9], // 1
  [1, 1, 5, 2, 1, 2, 9], // 2
  [1, 6, 5, 2, 1, 2, 9], // 3
  [1, 2, 23, 2, 1, 2, 9], // 4
  [0, 1, 5, 2, 1, 2, 9], // 5
  [1, 1, 54, 21, 1, 2, 9], // 6
  [14, 11, 54, 21, 1, 2, 9], // 7
];

//------Загальний прибуток
let sum = 0;
for (let wekIndex = 0; wekIndex < incomes.length; wekIndex++) {
  for (let dayIndex = 0; dayIndex < 7; dayIndex++) {
    sum += incomes[wekIndex][dayIndex];
  }
}
document.write(`sum : ${sum}<br>`);

// --- Сума за робочі дні
let workingSum = 0;
for (let wekIndex = 0; wekIndex < incomes.length; wekIndex++) {
  for (let dayIndex = 0; dayIndex < 5; dayIndex++) {
    workingSum += incomes[wekIndex][dayIndex];
  }
}
document.write(`workingSum : ${workingSum}<br>`);

//--- Сума за вихідні дні
let weekndSum = 0;
for (let wekIndex = 0; wekIndex < incomes.length; wekIndex++) {
  for (let dayIndex = 5; dayIndex < 7; dayIndex++) {
    weekndSum += incomes[wekIndex][dayIndex];
  }
}
document.write(`weekndSum : ${weekndSum}<br>`);

//--- Сума за парні дні (0- парний)
let evenSum = 0;
for (let wekIndex = 0; wekIndex < incomes.length; wekIndex += 2) {
  for (let dayIndex = 0; dayIndex < 7; dayIndex++) {
    evenSum += incomes[wekIndex][dayIndex];
  }
}
document.write(`evenSum : ${evenSum}<br>`);

//------Загальний прибуток за тиждень №3  (incomes[3])
let sumWek_3 = 0;
for (let dayIndex = 0; dayIndex < 7; dayIndex++) {
  sumWek_3 += incomes[3][dayIndex];
}
document.write(`evenSum : ${sumWek_3}<br>`);

//------Загальний прибуток за вівторок (номер дня == 1)
let sumTuesday = 0;
for (let wekIndex = 0; wekIndex < incomes.length; wekIndex += 2) {
  sumTuesday += incomes[wekIndex][1];
}
document.write(`evenSum : ${sumTuesday}<br>`);
// Задача. Дано кількість відвідувачів кафе протягом року (для кожного місяця за кожен заокруглений тиждень - 4).
const profits = [
  [1200, 1500, 1700, 1600], // Прибуток за перший місяць
  [1400, 1600, 1800, 1700], // Прибуток за другий місяць
  [1300, 1550, 1750, 1650], // Прибуток за третій місяць
  [1100, 1450, 1600, 1550], // Прибуток за четвертий місяць
  [1250, 1500, 1850, 1800], // Прибуток за п’ятий місяць
  [1350, 1600, 1900, 1700], // Прибуток за шостий місяць
  [1450, 1700, 2000, 1800], // Прибуток за сьомий місяць
  [1500, 1750, 2100, 1900], // Прибуток за восьмий місяць
  [1550, 1800, 2200, 2000], // Прибуток за дев’ятий місяць
  [1600, 1850, 2300, 2100], // Прибуток за десятий місяць
  [1650, 1900, 2200], // Прибуток за одинадцятий місяць
  [1700, 2000], // Прибуток за дванадцятий місяць
]
// Визначити :

// 1) загальну кількість відвідувачів;
let profitSum = 0;
for (let profitIndex = 0; profitIndex < profits.length; profitIndex++) {
  for (let weekNumber = 0; weekNumber < profits[profitIndex].length; weekNumber++) {
    profitSum += profits[profitIndex][weekNumber];
  }
}
document.write(`profitSum : ${profitSum}<br>`);
let profitSum1 = 0;
for (const profitIndex of profits) { 
	for (const weekNumber of profitIndex) {
		profitSum1 += weekNumber
	}
}
document.write(`profitSum1 : ${profitSum1}<br>`);

// 2) кількість відвідувачів за літо (5-7)
let profitSummerSum = 0;
for (let profitIndex = 5; profitIndex < 8; profitIndex++) {
  for (let index = 0; index < profits[profitIndex].length; index++) {
    profitSummerSum = profits[profitIndex][index];
  }
}
document.write(`profitSummerSum : ${profitSummerSum}<br>`);

// 3) кількість відвідувачів за друге півріччя
let sumProfit = 0;
for (  let profitIndex = 6; profitIndex < profits.length;  profitIndex++) {
  for (let index = 0; index < profits[profitIndex].length; index++) {
    sumProfit = profits[profitIndex][index];
  }
}
document.write(`profitSummerSum : ${sumProfit}<br>`);

//  У місті є К шкіл по 11 класів у кожній. Відомі величини зросту учнів (кількість учнів у класі від 15 до 30).
const schools = [
  [
    // Школа 1
    [140, 155, 160, 149, 170, 165, 180, 175, 150, 152, 148, 149, 151, 153, 154],
    [
      130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 185, 150, 148, 149,
      151,
    ],
    [150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178],
    [145, 147, 149, 151, 153, 155, 163, 165, 167, 169, 171, 173],
    [140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168],
    [150, 155, 160, 165, 170, 175, 180, 185, 155, 157],
    [135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158],
    [140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168],
    [150, 151, 152, 153, 154, 160, 161, 162, 163, 164],
    [145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160, 162],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
  ],

  [
    // Школа 2
    [150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
    [130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156],
    [150, 155, 160, 165, 170, 175, 158, 160, 162, 164],
    [140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168],
    [150, 151, 152, 153, 154, 161, 162, 163, 164],
    [145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160, 162],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
    [150, 152, 154, 156, 158, 160, 162, 176, 178],
    [135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
  ],

  [
    // Школа 3
    [150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160, 162, 164],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
    [130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156],
    [150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178],
    [140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168],
    [150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164],
    [145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160, 162],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
    [150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178],
    [135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
  ],

  [
    // Школа 4
    [150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160, 162, 164],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
    [130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156],
    [150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178],
    [140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168],
    [150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164],
    [145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160, 162],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
    [150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178],
    [135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158],
    [140, 145, 150, 155, 160, 165, 170, 175, 180, 150, 152, 154, 156, 158, 160],
  ],
]

// Знайти найвищого учня (вивести у якій школі, класі він начається)
const NUMBER_OF_CLASSESIN_SCHOOL = 11;
let pupilMax = 0;
let scholMax = 0;
let classMax = 0;

for (let scholInd = 0; scholInd < schools.length; scholInd++) {
	for (let classInd = 0; classInd < NUMBER_OF_CLASSESIN_SCHOOL; classInd++) {
    for (
      let pupilInd = 0;
      pupilInd < schools[scholInd][classInd].length;
      pupilInd++
    ) {
      if (schools[scholInd][classInd][pupilInd] > pupilMax)
				pupilMax = schools[scholInd][classInd][pupilInd];
				scholMax = scholInd;
      	classMax = classInd;
    }
  }
}
document.write(`scholMax : ${scholMax}<br>`);
document.write(`classMax : ${classMax}<br>`);
document.write(`pupilMax : ${pupilMax}<br>`);


// Знайти зріс найвищого учня


//----- Знайти середній вік у кожній школі